export const divisions = [
  'ঢাকা',
  'চট্টগ্রাম',
  'রাজশাহী',
  'খুলনা',
  'সিলেট',
  'বরিশাল',
  'রংপুর',
  'ময়মনসিংহ',
] as const;

export const districtsByDivision: Record<string, string[]> = {
  'ঢাকা': [
    'ঢাকা', 'গাজীপুর', 'নারায়ণগঞ্জ', 'মানিকগঞ্জ', 'মুন্সিগঞ্জ', 'নরসিংদী',
    'টাঙ্গাইল', 'কিশোরগঞ্জ', 'শরীয়তপুর', 'মাদারীপুর', 'গোপালগঞ্জ', 'রাজবাড়ী',
    'ফরিদপুর',
  ],
  'চট্টগ্রাম': [
    'চট্টগ্রাম', 'কক্সবাজার', 'কুমিল্লা', 'ফেনী', 'নোয়াখালী', 'লক্ষ্মীপুর',
    'ব্রাহ্মণবাড়িয়া', 'চাঁদপুর', 'রাঙ্গামাটি', 'বান্দরবান', 'খাগড়াছড়ি',
  ],
  'রাজশাহী': [
    'রাজশাহী', 'নাটোর', 'পাবনা', 'বগুড়া', 'নওগাঁ', 'জয়পুরহাট', 'চাঁপাইনবাবগঞ্জ',
    'সিরাজগঞ্জ',
  ],
  'খুলনা': [
    'খুলনা', 'যশোর', 'সাতক্ষীরা', 'বাগেরহাট', 'নড়াইল', 'কুষ্টিয়া', 'মেহেরপুর',
    'ঝিনাইদহ', 'মাগুরা', 'চুয়াডাঙ্গা',
  ],
  'সিলেট': [
    'সিলেট', 'মৌলভীবাজার', 'হবিগঞ্জ', 'সুনামগঞ্জ',
  ],
  'বরিশাল': [
    'বরিশাল', 'পটুয়াখালী', 'ভোলা', 'ঝালকাঠি', 'পিরোজপুর', 'বরগুনা',
  ],
  'রংপুর': [
    'রংপুর', 'দিনাজপুর', 'কুড়িগ্রাম', 'লালমনিরহাট', 'নীলফামারী', 'ঠাকুরগাঁও',
    'পঞ্চগড়', 'গাইবান্ধা',
  ],
  'ময়মনসিংহ': [
    'ময়মনসিংহ', 'জামালপুর', 'শেরপুর', 'নেত্রকোণা', 'কিশোরগঞ্জ',
  ],
};
